
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/hkakehashi/webinar-202407/actions/runs/10139364817)



<pre><code>Apply complete! Resources: 1 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
2024-07-29T06:37:54.827Z [INFO]  Terraform version: 1.9.2
2024-07-29T06:37:54.827Z [INFO]  Go runtime version: go1.22.4
2024-07-29T06:37:54.827Z [INFO]  CLI args: []string{"/home/runner/work/_temp/23831141-3cc9-4295-9db8-9258731f1519/terraform-bin", "apply", "-lock-timeout=30m", "-auto-approve"}
2024-07-29T06:37:54.827Z [INFO]  CLI command args: []string{"apply", "-lock-timeout=30m", "-auto-approve"}
2024-07-29T06:37:54.828Z [INFO]  backend-s3.aws-base: Retrieved initial credentials: tf_backend.operation=Configure tf_backend.req_id=06ffb818-f161-4170-110b-6e4040113bb0 tf_backend.s3.bucket=s3backend-1xfu3xfk4bztr9-state-bucket tf_backend.s3.path=webinar202407/dev tf_aws.credentials_source=EnvConfigCredentials
2024-07-29T06:37:54.828Z [INFO]  backend-s3.aws-base: Assuming IAM Role: tf_backend.operation=Configure tf_backend.req_id=06ffb818-f161-4170-110b-6e4040113bb0 tf_backend.s3.bucket=s3backend-1xfu3xfk4bztr9-state-bucket tf_backend.s3.path=webinar202407/dev tf_aws.assume_role.external_id="" tf_aws.assume_role.source_identity="" tf_aws.assume_role.role_arn=arn:aws:iam::139157552660:role/s3backend-1xfu3xfk4bztr9-tf-assume-role tf_aws.assume_role.session_name=""
2024-07-29T06:37:55.636Z [INFO]  backend-s3.aws-base: Retrieved credentials: tf_backend.operation=Configure tf_backend.req_id=06ffb818-f161-4170-110b-6e4040113bb0 tf_backend.s3.bucket=s3backend-1xfu3xfk4bztr9-state-bucket tf_backend.s3.path=webinar202407/dev tf_aws.credentials_source=AssumeRoleProvider
2024-07-29T06:37:56.241Z [INFO]  backend-s3.aws-base: Retrieved caller identity from STS: tf_backend.operation=Configure tf_backend.req_id=06ffb818-f161-4170-110b-6e4040113bb0 tf_backend.s3.bucket=s3backend-1xfu3xfk4bztr9-state-bucket tf_backend.s3.path=webinar202407/dev
2024-07-29T06:37:56.391Z [INFO]  backend-s3.aws-base: Retrieved caller identity from STS: tf_backend.operation=Configure tf_backend.req_id=06ffb818-f161-4170-110b-6e4040113bb0 tf_backend.s3.bucket=s3backend-1xfu3xfk4bztr9-state-bucket tf_backend.s3.path=webinar202407/dev
2024-07-29T06:37:56.406Z [INFO]  backend/local: starting Apply operation
2024-07-29T06:37:56.979Z [INFO]  backend-s3: Downloading remote state: tf_backend.operation=Get tf_backend.req_id=c3136ae7-6b56-cf7d-1c1a-f1f66ad1b3d0 tf_backend.s3.bucket=s3backend-1xfu3xfk4bztr9-state-bucket tf_backend.s3.path=webinar202407/dev
2024-07-29T06:37:57.310Z [INFO]  provider: configuring client automatic mTLS
2024-07-29T06:37:57.330Z [INFO]  provider.terraform-provider-fastly_v5.11.0: configuring server automatic mTLS: timestamp=2024-07-29T06:37:57.330Z
2024-07-29T06:37:57.388Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/fastly/fastly/5.11.0/linux_amd64/terraform-provider-fastly_v5.11.0 id=1980
2024-07-29T06:37:57.391Z [INFO]  provider: configuring client automatic mTLS
2024-07-29T06:37:57.402Z [INFO]  provider.terraform-provider-fastly_v5.11.0: configuring server automatic mTLS: timestamp=2024-07-29T06:37:57.401Z
2024-07-29T06:37:57.454Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/fastly/fastly/5.11.0/linux_amd64/terraform-provider-fastly_v5.11.0 id=1989
2024-07-29T06:37:57.454Z [INFO]  backend/local: apply calling Plan
2024-07-29T06:37:57.456Z [INFO]  provider: configuring client automatic mTLS
2024-07-29T06:37:57.466Z [INFO]  provider.terraform-provider-fastly_v5.11.0: configuring server automatic mTLS: timestamp=2024-07-29T06:37:57.466Z
2024-07-29T06:37:57.517Z [WARN]  ValidateProviderConfig from "provider[\"registry.terraform.io/fastly/fastly\"]" changed the config value, but that value is unused
2024-07-29T06:37:57.541Z [WARN]  Provider "registry.terraform.io/fastly/fastly" produced an invalid plan for module.vcl_service.fastly_service_vcl.main, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .stale_if_error_ttl: planned value cty.NumberIntVal(43200) for a non-computed attribute
      - .default_ttl: planned value cty.NumberIntVal(3600) for a non-computed attribute
      - .stale_if_error: planned value cty.False for a non-computed attribute
      - .http3: planned value cty.False for a non-computed attribute
      - .comment: planned value cty.StringVal("Managed by Terraform") for a non-computed attribute
2024-07-29T06:37:57.545Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/fastly/fastly/5.11.0/linux_amd64/terraform-provider-fastly_v5.11.0 id=1999

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:
2024-07-29T06:37:57.549Z [INFO]  backend/local: apply calling Apply

  # module.vcl_service.fastly_service_vcl.main will be created
  + resource "fastly_service_vcl" "main" {
      + activate           = true
      + active_version     = (known after apply)
      + cloned_version     = (known after apply)
      + comment            = "Managed by Terraform"
      + default_ttl        = 3600
      + force_destroy      = true
      + force_refresh      = (known after apply)
      + http3              = false
      + id                 = (known after apply)
      + imported           = (known after apply)
      + name               = "webinar202407-dev"
      + stale_if_error     = false
      + stale_if_error_ttl = 43200
      + version_comment    = <<-EOT
            PR#1: Add code comments to test the pipeline
            https://github.com/hkakehashi/webinar-202407/pull/1
        EOT

      + backend {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + domain {
          + name    = "webinar202407-dev.global.ssl.fastly.net"
            # (1 unchanged attribute hidden)
        }

      + vcl {
          + content = <<-EOT
                sub vcl_recv {
                #FASTLY recv
                  # comment for CI test
                
                  # Normally, you should consider requests other than GET and HEAD to be uncacheable
                  # (to this we add the special FASTLYPURGE method)
                  if (req.method != "HEAD" && req.method != "GET" && req.method != "FASTLYPURGE") {
                    return(pass);
                  }
                
                  # If you are using image optimization, insert the code to enable it here
                  # See https://www.fastly.com/documentation/reference/io/ for more information.
                
                  return(lookup);
                }
                
                sub vcl_hash {
                  set req.hash += req.url;
                  set req.hash += req.http.host;
                #FASTLY hash
                  return(hash);
                }
                
                sub vcl_hit {
                #FASTLY hit
                  return(deliver);
                }
                
                sub vcl_miss {
                #FASTLY miss
                  return(fetch);
                }
                
                sub vcl_pass {
                #FASTLY pass
                  return(pass);
                }
                
                sub vcl_fetch {
                #FASTLY fetch
                
                  # Unset headers that reduce cacheability for images processed using the Fastly image optimizer
                  if (req.http.X-Fastly-Imageopto-Api) {
                    unset beresp.http.Set-Cookie;
                    unset beresp.http.Vary;
                  }
                
                  # Log the number of restarts for debugging purposes
                  if (req.restarts > 0) {
                    set beresp.http.Fastly-Restarts = req.restarts;
                  }
                
                  # If the response is setting a cookie, make sure it is not cached
                  if (beresp.http.Set-Cookie) {
                    return(pass);
                  }
                
                  # By default we set a TTL based on the `Cache-Control` header but we don't parse additional directives
                  # like `private` and `no-store`. Private in particular should be respected at the edge:
                  if (beresp.http.Cache-Control ~ "(?:private|no-store)") {
                    return(pass);
                  }
                
                  # If no TTL has been provided in the response headers, set a default
                  if (http_status_matches(beresp.status, "200,206,301,302")) {
                    if (!beresp.http.Cache-Control) {
                      set beresp.ttl = 86400s;
                      set beresp.http.Cache-Control = "max-age=86400";
                
                      # Apply a longer default TTL for images processed using Image Optimizer
                      if (req.http.X-Fastly-Imageopto-Api) {
                        set beresp.ttl = 2592000s; # 30 days
                        set beresp.http.Cache-Control = "max-age=2592000, public";
                      }
                    }
                  }
                
                  return(deliver);
                }
                
                sub vcl_error {
                #FASTLY error
                  return(deliver);
                }
                
                sub vcl_deliver {
                #FASTLY deliver
                
                  if (req.http.Fastly-Debug) {
                    set resp.http.Fastly-Debug-VCL-Version = req.vcl.version;
                  }
                
                  return(deliver);
                }
                
                sub vcl_log {
                #FASTLY log
                }
            EOT
          + main    = true
          + name    = "main"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + active_version = (known after apply)
  + service_id     = (known after apply)
  + service_url    = (known after apply)
2024-07-29T06:37:57.552Z [INFO]  provider: configuring client automatic mTLS
2024-07-29T06:37:57.568Z [INFO]  provider.terraform-provider-fastly_v5.11.0: configuring server automatic mTLS: timestamp=2024-07-29T06:37:57.568Z
2024-07-29T06:37:57.619Z [WARN]  ValidateProviderConfig from "provider[\"registry.terraform.io/fastly/fastly\"]" changed the config value, but that value is unused
2024-07-29T06:37:57.642Z [WARN]  Provider "registry.terraform.io/fastly/fastly" produced an invalid plan for module.vcl_service.fastly_service_vcl.main, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .stale_if_error_ttl: planned value cty.NumberIntVal(43200) for a non-computed attribute
      - .default_ttl: planned value cty.NumberIntVal(3600) for a non-computed attribute
      - .stale_if_error: planned value cty.False for a non-computed attribute
      - .http3: planned value cty.False for a non-computed attribute
      - .comment: planned value cty.StringVal("Managed by Terraform") for a non-computed attribute
module.vcl_service.fastly_service_vcl.main: Creating...
2024-07-29T06:37:57.644Z [INFO]  Starting apply for module.vcl_service.fastly_service_vcl.main
2024-07-29T06:38:00.973Z [WARN]  Provider "provider[\"registry.terraform.io/fastly/fastly\"]" produced an unexpected new value for module.vcl_service.fastly_service_vcl.main, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .default_host: was null, but now cty.StringVal("")
module.vcl_service.fastly_service_vcl.main: Creation complete after 3s [id=4mmjVGzXDhjnHocNHdmtA7]
2024-07-29T06:38:00.976Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/fastly/fastly/5.11.0/linux_amd64/terraform-provider-fastly_v5.11.0 id=2013
2024-07-29T06:38:00.977Z [INFO]  backend-s3: Uploading remote state: tf_backend.operation=Put tf_backend.req_id=db1db0fc-9551-a870-6d83-e770681a4222 tf_backend.s3.bucket=s3backend-1xfu3xfk4bztr9-state-bucket tf_backend.s3.path=webinar202407/dev

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

Outputs:

active_version = 1
service_id = "4mmjVGzXDhjnHocNHdmtA7"
service_url = "https://cfg.fastly.com/4mmjVGzXDhjnHocNHdmtA7"

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":1,"Program":"tfcmt","SHA1":"0cfb438ff529d1234bb9432fbd4a2c2bcb210c9f","Vars":{},"WorkflowName":"Run Terraform"} -->